# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [15]:
# code

import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [16]:
# code
from numpy import random
x = random.randint(1,5,size = (100))
y = random.randint(1,4,size = (100))
z = random.randint(10000,30001,size = (100))
print(x)

print(y)

print(z)

[2 4 2 4 1 2 3 2 1 3 2 3 1 3 3 3 3 4 3 4 3 1 4 3 3 2 2 2 4 2 3 1 2 3 2 2 3
 4 1 3 4 2 2 4 2 2 3 1 3 1 2 2 1 2 1 4 2 2 1 3 4 1 3 4 2 1 2 2 4 1 3 2 1 3
 4 4 3 1 4 2 3 2 1 1 3 3 3 4 1 3 2 4 1 2 2 3 2 3 1 2]
[1 2 2 2 3 3 1 3 2 2 3 3 3 3 3 1 3 3 2 2 3 2 2 1 1 2 3 3 1 1 3 3 3 2 2 3 2
 1 2 3 2 3 1 2 3 2 1 1 3 3 1 3 2 2 3 2 2 3 1 2 3 2 1 1 3 2 1 2 3 1 1 2 1 2
 1 3 2 2 3 1 1 2 1 2 1 2 3 3 2 3 3 3 2 2 2 3 2 1 3 2]
[18100 19496 13514 21397 10874 22609 26299 10747 20894 19688 17976 20906
 11804 22410 23514 27586 28931 28044 22915 28002 24933 26705 23867 11055
 13773 14666 21762 13977 24902 20092 25459 25688 19978 10537 20708 29998
 18997 11952 17320 11614 17062 13004 27815 26727 21515 13920 23687 21924
 20746 12990 14640 12988 16784 20985 10441 19801 22178 18421 14647 16940
 17189 28743 24096 13854 28997 29329 18621 19165 29595 23208 16634 16227
 15575 15016 27460 16702 26518 28944 25974 22838 28176 13898 15608 27746
 24905 23489 26586 26349 23716 28905 20521 29824 29570 29305 18535 27197
 20480 29208 24198 24778]

### Step 3. Let's create a DataFrame by joinning the Series by column

In [17]:
# code
x = pd.Series(x)
x

0     2
1     4
2     2
3     4
4     1
     ..
95    3
96    2
97    3
98    1
99    2
Length: 100, dtype: int32

In [18]:
y = pd.Series(y)
y

0     1
1     2
2     2
3     2
4     3
     ..
95    3
96    2
97    1
98    3
99    2
Length: 100, dtype: int32

In [19]:
z = pd.Series(z)
z

0     18100
1     19496
2     13514
3     21397
4     10874
      ...
95    27197
96    20480
97    29208
98    24198
99    24778
Length: 100, dtype: int32

In [20]:
df = pd.concat([x,y,z],axis=1)
df.head()

   0  1      2
0  2  1  18100
1  4  2  19496
2  2  2  13514
3  4  2  21397
4  1  3  10874

### Step 4. Change the name of the columns to bedrooms, bathrooms, price_sqr_meter

In [21]:
# code
df.rename(columns = {0:'bedrooms',1: 'bathrooms',2: 'price_sqr_meter'},inplace = True)
df.head()

   bedrooms  bathrooms  price_sqr_meter
0         2          1            18100
1         4          2            19496
2         2          2            13514
3         4          2            21397
4         1          3            10874

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [22]:
# code
bigcolumn = pd.concat([x,y,z])
bigcolumn = pd.DataFrame(bigcolumn)
bigcolumn.head()

   0
0  2
1  4
2  2
3  4
4  1

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [23]:
# code
bigcolumn

        0
0       2
1       4
2       2
3       4
4       1
..    ...
95  27197
96  20480
97  29208
98  24198
99  24778

[300 rows x 1 columns]

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [24]:
# code
bigcolumn.reset_index(inplace = True,drop = True)
bigcolumn

         0
0        2
1        4
2        2
3        4
4        1
..     ...
295  27197
296  20480
297  29208
298  24198
299  24778

[300 rows x 1 columns]